---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.OpenConnector
source: html/098afb68-570d-4fca-4729-ceeff22bb50d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.OpenConnector Property

The element has an open connector

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenConnector { get; }
```